src/InformationRegisters/synс_ConnectionSettings/synс_ConnectionSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>synс_ConnectionSettings</name>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.synс_Server</types>
    </type>
  </resources>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>CatalogRef.synс_Methods</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/synс_Methods/synс_Methods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>synс_Methods</name>
  <owners>Catalog.synс_Services</owners>
  <attributes>
    <name>ИмяHTTPМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URLСсылкаНаДокументацию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонHTTPМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАвторизацияПоЛогинуПаролю</name>
    <comment>Вход в систему по логину/паролю</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоАвторизацияПоRefreshToken</name>
    <comment>Повторная авторизация в системе с использованием refresh_token</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИменаПолейДат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заголовки</name>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>CatalogRef.synс_HeadersHTTP</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/synс_ConnectionSettings/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьURLСсылкаНаДокументацию();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СерверПриИзменении(Элемент)
	ЗаполнитьURLСсылкаНаДокументацию();
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	ЗаполнитьURLСсылкаНаДокументацию();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонHTTPМетодаПриИзменении(Элемент)
	ЗаполнитьURLСсылкаНаДокументацию();
КонецПроцедуры


&НаКлиенте
Процедура МетодПриИзменении(Элемент)
	ЗаполнитьURLСсылкаНаДокументацию();
КонецПроцедуры

&НаКлиенте
Процедура URLСсылкаНаДокументациюОткрытие(Элемент, СтандартнаяОбработка)
	пр_Клиент.ОткрытьПриложение(Запись.URLСсылкаНаДокументацию);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПолученияНастроекПодключения()
	
	Возврат
	
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СерверИнфо.Сервер, """") КАК Сервер,
		|	ЕСТЬNULL(МетодИнфо.Версия, """") КАК Версия,
		|	ЕСТЬNULL(МетодИнфо.Сервис, """") КАК Сервис,
		|	ЕСТЬNULL(МетодИнфо.Метод, """") КАК Метод
		|ИЗ
		|	(ВЫБРАТЬ
		|		synс_Server.Наименование КАК Сервер
		|	ИЗ
		|		Справочник.synс_Server КАК synс_Server
		|	ГДЕ
		|		synс_Server.Ссылка = &Сервер) КАК СерверИнфо,
		|	(ВЫБРАТЬ
		|		synс_Methods.Версия КАК Версия,
		|		synс_Methods.Владелец.Код КАК Сервис,
		|		synс_Methods.Наименование КАК Метод
		|	ИЗ
		|		Справочник.synс_Methods КАК synс_Methods
		|	ГДЕ
		|		synс_Methods.Ссылка = &Метод) КАК МетодИнфо
		|";
	
КонецФункции 

Процедура ЗаполнитьURLСсылкаНаДокументацию()
	
	URLСервиса = "";
	
	Если НЕ ЗначениеЗаполнено(Запись.Метод) 
		ИЛИ НЕ ЗначениеЗаполнено(Запись.Сервер) Тогда
		Возврат ;
	КонецЕсли; 
	
	АдресРесурса = пр_Общий.ЗначениеРеквизитаПоСсылке(Запись.Метод, "АдресРесурса");
	URLСервиса = СтрШаблон("http://%1/%2", Запись.Сервер, АдресРесурса);	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = ТекстЗапросаПолученияНастроекПодключения();
	//
	//Запрос.УстановитьПараметр("Метод", Запись.Метод);
	//Запрос.УстановитьПараметр("Сервер", Запись.Сервер);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВДЗ = РезультатЗапроса.Выбрать();
	//
	//Если ВДЗ.Следующий() Тогда
	//	URLСервиса = СтрШаблон("http://%1/%2/%3/%4", ВДЗ.Сервер, ВДЗ.Версия, ВДЗ.Сервис, ВДЗ.Метод);	
	//Иначе
	//	URLСервиса = "";	
	//КонецЕсли; 
	
	//Сервис = пр_Общий.ЗначениеРеквизитаПоСсылке(Запись.Метод, "Владелец");
	//СервисКод = пр_Общий.ЗначениеРеквизитаПоСсылке(Сервис, "Код");
	//
	//МассивПолей = СтрРазделить(Запись.ШаблонHTTPМетода, ",");
	//
	//URLСервиса = "http://";
	//КоличествоОграничения = МассивПолей.Количество();
	//Сч = 1;
	//
	//Для каждого ИмяПоля Из МассивПолей Цикл
	//	
	//	Если ИмяПоля = "Сервис" Тогда
	//		Значение = СервисКод;		
	//	Иначе
	//		Значение = Запись[ИмяПоля];		
	//	КонецЕсли; 
	//	
	//	ДобавитьСтроку(URLСервиса, КоличествоОграничения, Значение, Сч, "/");
	//	
	//КонецЦикла; 
	
	//URLСервиса = СтрШаблон("http://%1/%2/%3/%4", Запись.Сервер, Запись.Версия, СервисКод, Запись.Метод);	
	
КонецПроцедуры 

Функция ДобавитьСтроку(ТекстДобавления, КоличествоОграничения, Значение, Сч, Разделитель)
	ТекщийРазделитель = ?(Сч = КоличествоОграничения, "", Разделитель);
	ТекстДобавления = СтрШаблон("%1%2%3", ТекстДобавления, Значение, ТекщийРазделитель);
	Сч = Сч + 1;
КонецФункции 



#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

#КонецОбласти
